# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11-BiFPN-PGI 融合版（修复维度不匹配）
nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]
fusion_mode: bifpn
node_mode: C3k2
head_channel: 256

# Backbone（保留原版）
backbone:
  - [-1, 1, Silence, []] # 0
  - [-1, 1, Conv, [64, 3, 2]] # 1-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 2-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 3
  - [-1, 1, Conv, [256, 3, 2]] # 4-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 5
  - [-1, 1, Conv, [512, 3, 2]] # 6-P4/16
  - [-1, 2, C3k2, [512, True]] # 7
  - [-1, 1, Conv, [1024, 3, 2]] # 8-P5/32
  - [-1, 2, C3k2, [1024, True]] # 9
  - [-1, 1, SPPF, [1024, 5]] # 10
  - [-1, 2, C2PSA, [1024]] # 11 (PGI核心)

# Head（核心修改：仅保留P3/P4/P5检测尺度，适配YOLO原生逻辑）
head:
  # PGI 特征路由（仅保留P3/P4/P5，移除P2路由）
  - [5, 1, CBLinear, [[256]]] # 12 (P3路由)
  - [7, 1, CBLinear, [[256, 512]]] # 13 (P4路由)
  - [9, 1, CBLinear, [[256, 512, 1024]]] # 14 (P5路由)

  # 基础特征提取+通道对齐（仅P3/P4/P5）
  - [5, 1, Conv, [head_channel, 1, 1]] # 15-P3/8 (通道256)
  - [7, 1, Conv, [head_channel, 1, 1]] # 16-P4/16 (通道256)
  - [11, 1, Conv, [head_channel, 1, 1]] # 17-P5/32 (通道256)

  # BiFPN 自上而下融合（P5→P4→P3）
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 18 (P5上采样到P4)
  - [[-1, 16], 1, Fusion, [fusion_mode]] # 19 (融合P4基础+P5上采样)
  - [-1, 2, node_mode, [head_channel, False]] # 20 (P4细化)

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 21 (P4上采样到P3)
  - [[-1, 15], 1, Fusion, [fusion_mode]] # 22 (融合P3基础+P4上采样)
  - [-1, 2, node_mode, [head_channel, False]] # 23 (P3融合输出)

  # BiFPN 自下而上融合（P3→P4→P5）
  - [-1, 1, Conv, [head_channel, 3, 2]] # 24 (P3下采样到P4)
  - [[-1, 20], 1, Fusion, [fusion_mode]] # 25 (融合P4融合+P3下采样)
  - [-1, 2, node_mode, [head_channel, False]] # 26 (P4融合输出)

  - [-1, 1, Conv, [head_channel, 3, 2]] # 27 (P4下采样到P5)
  - [[-1, 17], 1, Fusion, [fusion_mode]] # 28 (融合P5基础+P4下采样)
  - [-1, 2, node_mode, [head_channel, True]] # 29 (P5融合输出)

  # PGI 特征融合分支（仅保留P3/P4/P5，移除P2分支）
  - [0, 1, Conv, [64, 3, 2]] # 30-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 31-P2/4
  - [-1, 2, C3k2, [128, False]] # 32-P2/4
  - [-1, 1, Conv, [256, 3, 2]] # 33-P3/8
  - [[12, 13, 14, -1], 1, CBFuse, [[0, 0, 0]]] # 34
  - [-1, 2, C3k2, [256, False]] # 35 (PGI-P3输出)

  - [-1, 1, Conv, [512, 3, 2]] # 36-P4/16
  - [[13, 14, -1], 1, CBFuse, [[1, 1]]] # 37
  - [-1, 2, C3k2, [512, False]] # 38 (PGI-P4输出)

  - [-1, 1, Conv, [1024, 3, 2]] # 39-P5/32
  - [[14, -1], 1, CBFuse, [[2]]] # 40
  - [-1, 2, C3k2, [1024, True]] # 41 (PGI-P5输出)

  # 检测头（仅输入3个尺度：BiFPN+PGI的P3/P4/P5，共6个特征，适配YOLO原生维度）
  - [[23, 26, 29, 35, 38, 41], 1, DetectAux, [nc]] # 42