# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 319 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 319 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 409 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512] # summary: 631 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512] # summary: 631 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs
fusion_mode: bifpn
node_mode: C3k2_DWR
head_channel: 256

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# YOLO11n head
head:
  # 第一步：提取各层基础特征（通道数统一为head_channel=256）
  - [2, 1, Conv, [head_channel, 1, 1]]  # 11-P2/4 (160x160, 256) 【修改：加1x1卷积确保通道对齐】
  - [4, 1, Conv, [head_channel, 1, 1]]  # 12-P3/8 (80x80, 256)
  - [6, 1, Conv, [head_channel, 1, 1]]  # 13-P4/16 (40x40, 256)
  - [10, 1, Conv, [head_channel, 1, 1]] # 14-P5/32 (20x20, 256)

  # 第二步：自上而下融合（P5→P4→P3→P2）
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 15 (40x40, 256) P5→P4
  - [[-1, 13], 1, Fusion, [fusion_mode]] # 16 (40x40, 256) P4融合
  - [-1, 3, node_mode, [head_channel, False]] # 17 (40x40, 256)

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 18 (80x80, 256) P4→P3
  - [[-1, 12], 1, Fusion, [fusion_mode]] # 19 (80x80, 256) P3融合
  - [-1, 3, node_mode, [head_channel, False]] # 20 (80x80, 256)

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 21 (160x160, 256) P3→P2
  - [[-1, 11], 1, Fusion, [fusion_mode]] # 22 (160x160, 256) P2融合
  - [-1, 3, node_mode, [head_channel, False]] # 23 (160x160, 256)

  # 第三步：自下而上融合（P2→P3→P4→P5）【核心修正：输入索引和尺寸对齐】
  - [-1, 1, Conv, [head_channel, 3, 2]] # 24 (80x80, 256) P2→P3
  - [[-1, 20], 1, Fusion, [fusion_mode]] # 25 (80x80, 256) 【修改：移除11，只融合-1和20（均为80x80）】
  - [-1, 3, node_mode, [head_channel, False]] # 26 (80x80, 256)

  - [-1, 1, Conv, [head_channel, 3, 2]] # 27 (40x40, 256) P3→P4
  - [[-1, 17], 1, Fusion, [fusion_mode]] # 28 (40x40, 256) 【修改：移除12，只融合-1和17（均为40x40）】
  - [-1, 3, node_mode, [head_channel, False]] # 29 (40x40, 256)

  - [-1, 1, Conv, [head_channel, 3, 2]] # 30 (20x20, 256) P4→P5
  - [[-1, 14], 1, Fusion, [fusion_mode]] # 31 (20x20, 256) 【修改：移除13，只融合-1和14（均为20x20）】
  - [-1, 3, node_mode, [head_channel, False]] # 32 (20x20, 256)

  # 第四步：Detect层（适配4尺度，需确保Detect层支持4输入）
  - [[23, 26, 29, 32], 1, Detect_SEAM, [nc]]  # 【修改：输入为P2/P3/P4/P5的融合输出，尺寸分别为160/80/40/20】
