# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 object detection model with P2-P5 outputs (新增P2检测头)

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 319 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 319 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 409 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512] # summary: 631 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512] # summary: 631 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

# YOLO11n backbone (保留P2特征层，新增C3k2增强P2特征)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4 (原始P2层，补充特征增强)
  - [-1, 2, C3k2, [256, False, 0.25]] # 2-P2特征增强
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4-P3特征增强
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]] # 6-P4特征增强
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# YOLO11n head (新增P2检测分支)
head:
  # 原始P5->P4上采样分支
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2_Faster_EMA, [512, False]] # 13

  # 原始P4->P3上采样分支
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2_Faster_EMA, [256, False]] # 16 (P3/8-small)

  # 新增P3->P2上采样分支 (核心修改)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # P3上采样到P2尺度
  - [[-1, 2], 1, Concat, [1]] # cat backbone P2 (第2层是增强后的P2特征)
  - [-1, 2, C3k2_Faster_EMA, [128, False]] # 19 (P2/4-xsmall) 新增P2检测头

  # P2->P3下采样分支 (对应新增的反向分支)
  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 16], 1, Concat, [1]] # cat head P3
  - [-1, 2, C3k2_Faster_EMA, [256, False]] # 22 (P3/8-small 重增强)

  # 原始P3->P4下采样分支
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2_Faster_EMA, [512, False]] # 25 (P4/16-medium)

  # 原始P4->P5下采样分支
  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 2, C3k2_Faster_EMA, [1024, True]] # 28 (P5/32-large)

  # 修改Detect层输入：包含P2/P3/P4/P5 (核心修改)
  - [[19, 22, 25, 28], 1, Detect_SEAM, [nc]] # Detect(P2, P3, P4, P5)